app/Cells/ArtikelTerkini.php

    public function render(): string
    {
        $model = new ArtikelModel();
        $artikel = $model->orderBy('created_at', 'DESC')->limit(5)->findAll();
---
SELECT *
FROM `artikel`
ORDER BY `created_at` DESC
 LIMIT 5