app/Controllers/AjaxController.php

SELECT *
FROM `kategori`
ORDER BY `nama_kategori` ASC
---
    public function index(): string
    {
        $kategoriModel = new KategoriModel();

        return view('ajax/index', [
            'title'    => 'Dashboard Pengelolaan Artikel',
            'kategori' => $kategoriModel->orderBy('nama_kategori', 'ASC')->findAll(),

SELECT `artikel`.*, `kategori`.`nama_kategori`, `kategori`.`slug_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
ORDER BY `artikel`.`id` DESC
---
    public function getData()
    {
        $model = new ArtikelModel();
        $data = $model->select('artikel.*, kategori.nama_kategori, kategori.slug_kategori')
            ->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'left')
            ->orderBy('artikel.id', 'DESC')
            ->findAll();

INSERT INTO `artikel` (`judul`, `isi`, `slug`, `status`, `id_kategori`, `gambar`) VALUES ('Diagram Sistem', 'Diagram Sistem', 'diagram-sistem', 1, 4, '1779337323_c513fc6592b5c102ca30.png')
---
        }

        $model = new ArtikelModel();
        $model->insert($data);

SELECT *
FROM `kategori`
WHERE `kategori`.`id_kategori` = 4
---
    private function validateArtikelPayload(array $payload): array
    {
        $errors = [];

        if ($payload['judul'] === '' || mb_strlen($payload['judul']) < 3) {
            $errors['judul'] = 'Judul wajib diisi minimal 3 karakter.';
        }

        if ($payload['isi'] === '' || mb_strlen($payload['isi']) < 10) {
            $errors['isi'] = 'Isi artikel wajib diisi minimal 10 karakter.';
        }

        if ($payload['id_kategori'] === '' || ! ctype_digit($payload['id_kategori'])) {
            $errors['id_kategori'] = 'Kategori wajib dipilih.';
        } else {
            $kategoriModel = new KategoriModel();
            if (! $kategoriModel->find((int) $payload['id_kategori'])) {