app/Controllers/Artikel.php

    public function index(): string
    {
        $title = 'Daftar Artikel';
        $model = new ArtikelModel();
        $artikel = $model->findAll();
---
SELECT *
FROM `artikel`

    public function view($slug): string
    {
        $model = new ArtikelModel();
        $artikel = $model->where(['slug' => $slug])->first();
---
SELECT *
FROM `artikel`
WHERE `slug` = 'artikel-pertama'
 LIMIT 1

    public function admin_index(): string
    {
        $title = 'Daftar Artikel';
        $model = new ArtikelModel();
        $artikel = $model->findAll();
---
SELECT *
FROM `artikel`

    public function edit($id)
    {
        helper(['form']);

        $artikelModel = new ArtikelModel();
        $data = $artikelModel->where('id', $id)->first();
---
SELECT *
FROM `artikel`
WHERE `id` = '2'
 LIMIT 1