app/Controllers/Artikel.php

SELECT *
FROM `kategori`
ORDER BY `nama_kategori` ASC
---
    public function index(): string
    {
        $title = 'Daftar Artikel';
        $kategoriSlug = trim((string) ($this->request->getVar('kategori') ?? ''));
        $materiKategori = trim((string) ($this->request->getVar('materi_kategori') ?? ''));
        $materiTipe = trim((string) ($this->request->getVar('materi_tipe') ?? ''));

        if (! in_array($materiTipe, ['pertemuan', 'praktikum'], true)) {
            $materiTipe = '';
        }

        $model = new ArtikelModel();
        $kategoriModel = new KategoriModel();

        $artikel = $model->getArtikelDenganKategori($kategoriSlug);
        $kategoriList = $kategoriModel->orderBy('nama_kategori', 'ASC')->findAll();

SELECT COUNT(*) AS `numrows`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
SELECT `artikel`.*, `kategori`.`nama_kategori`, `kategori`.`slug_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
ORDER BY `artikel`.`id` DESC
 LIMIT 10
SELECT *
FROM `kategori`
ORDER BY `nama_kategori` ASC
---
    public function admin_index(): string
    {
        $title = 'Daftar Artikel';
        $q = trim((string) ($this->request->getVar('q') ?? ''));
        $kategori_id = trim((string) ($this->request->getVar('kategori_id') ?? ''));

        $model = new ArtikelModel();
        $kategoriModel = new KategoriModel();

        $model->select('artikel.*, kategori.nama_kategori, kategori.slug_kategori')
            ->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'left');

        if ($q !== '') {
            $model->like('artikel.judul', $q);
        }

        if ($kategori_id !== '') {
            $model->where('artikel.id_kategori', (int) $kategori_id);
        }

        $artikel = $model->orderBy('artikel.id', 'DESC')->paginate(10);

        return view('artikel/admin_index', [
            'title'       => $title,
            'q'           => $q,
            'kategori_id' => $kategori_id,
            'kategori'    => $kategoriModel->orderBy('nama_kategori', 'ASC')->findAll(),
            'artikel'     => $artikel,
            'pager'       => $model->pager,
        ]);